{"format": "layers-model", "generatedBy": "keras v2.9.0", "convertedBy": "TensorFlow.js Converter v1.7.0", "userDefinedMetadata": {"name": "AverageWordVec text classifier", "description": "Classify text into predefined categories.", "version": "v1", "subgraph_metadata": [{"input_tensor_metadata": [{"name": "input_text", "description": "Embedding vectors representing the input text to be classified. The input need to be converted from raw text to embedding vectors using the attached dictionary file.", "content": {"content_properties_type": "FeatureProperties", "content_properties": {}}, "process_units": [{"options_type": "RegexTokenizerOptions", "options": {"delim_regex_pattern": "[^\\w\\']+", "vocab_file": [{"name": "vocab.txt", "description": "Vocabulary file to convert natural language words to embedding vectors.", "type": "VOCABULARY"}]}}]}], "output_tensor_metadata": [{"name": "probability", "description": "Probabilities of the labels respectively.", "content": {"content_properties_type": "FeatureProperties", "content_properties": {}}, "stats": {"max": [1.0], "min": [0.0]}, "associated_files": [{"name": "labels.txt", "description": "Labels for the categories that the model can classify.", "type": "TENSOR_AXIS_LABELS"}]}]}], "author": "TensorFlow Lite Model Maker", "license": "Apache License. Version 2.0 http://www.apache.org/licenses/LICENSE-2.0.", "min_parser_version": "1.2.1"}, "modelTopology": {"keras_version": "2.9.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_2"}}, {"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 20], "dtype": "float32", "input_dim": 2503, "output_dim": 7, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 20}}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 7, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_2/kernel", "shape": [7, 7], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [7], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [7, 2], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [2], "dtype": "float32"}, {"name": "embedding_1/embeddings", "shape": [2503, 7], "dtype": "float32"}]}]}